Shrimpaste/sensor-driver-4-autobox/examples/remote_box/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_NEWLIB_NANO_FORMAT=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Custom partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="../../partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="../../partitions.csv"

# Conservative defaults
CONFIG_REMOTE_BOX_MAX_LINEAR_MMPS=200
CONFIG_REMOTE_BOX_MAX_REVERSE_MMPS=120
CONFIG_REMOTE_BOX_MAX_ANGULAR_MRADPS=800
CONFIG_REMOTE_BOX_LIN_ACCEL=500
CONFIG_REMOTE_BOX_LIN_DECEL=1200
CONFIG_REMOTE_BOX_ANG_ACCEL=2500
